Revit 2023 API
ParameterUtils.GetBuiltInParameterGroup Method
 Gets the BuiltInParameterGroup value corresponding to built-in parameter group identified by the given ForgeTypeId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static BuiltInParameterGroup GetBuiltInParameterGroup(
	ForgeTypeId groupTypeId
)
Visual Basic
Public Shared Function GetBuiltInParameterGroup ( _
	groupTypeId As ForgeTypeId _
) As BuiltInParameterGroup
Visual C++
public:
static BuiltInParameterGroup GetBuiltInParameterGroup(
	ForgeTypeId^ groupTypeId
)
Parameters
groupTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
The parameter group identifier.
Return Value
The BuiltInParameterGroup value corresponding to the given parameter group identifier.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  groupTypeId is not a built-in parameter group identifier. See IsBuiltInParameterGroup(ForgeTypeId) and GetParameterGroupTypeId(BuiltInParameter).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace